first_num = int(input())
last_num = int(input())
# Даны два числа, если они равны выведите yes, иначе - no.
print(['no','yes'][first_num == last_num])

# Даны два числа, вывести на экран максимальное из них.
print(max(first_num, last_num))
